Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e
Database operation drawing creation methods. These must be identical to #define's in TS-code.
The common enum values must remain synchronized with the DrawingCreationEventMethodEnum enum from MasterDrawingSourceType.cs (DOT_APPS/Drawings/Applications/Cloning).
and the grDrawingCreationMethod_e enum from drawing_editor_event_tracking.hpp (Core/TeklaStructures/librgr_drawing_editor/interface).
Any mismatch may result in incorrect handling of Tranos events.

Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.Undefined


Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.AppliedSettings


Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.DrawingAttributes


Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.ServiceSuggestedLibraryAndSuggestedTemplate


Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.ServiceSuggestedLibraryAndSuggestedSettings


Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.ServiceManualLibraryAndSuggestedSettings


Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.ServiceManualLibraryAndSuggestedTemplate


Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.ServiceSuggestedLibraryAndManualSettings


Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.ServiceSuggestedLibraryAndManualTemplate


Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.ServiceManualLibraryAndManualSettings


Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.ServiceManualLibraryAndManualTemplate


Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.SmartCreateDrawing


Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.TraditionalClone


Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.SmartCreateAttributeFile


Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.RuleSet


Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.RuleSetCloningTemplate


Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.Copy


Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.WizardFile


Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.WizardFileCloningTemplate


Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.ServiceSuggestedLibraryAndSuggestedTopTemplate


Tekla.Structures.DrawingInternal.grDrawingCreationMethod_e.ServiceManualLibraryAndSuggestedTopTemplate
